
full_name = input("Ваші прізвище, ім'я, по батькові? ")
age = input("Скільки Вам років? ")
city = input("Де Ви живете? ")
university = input("Де Ви навчаєтесь? ")
group_number = input("Номер Вашої групи? ")
list_number = input("Який Ваш порядковий номер у списку групи? ")


questions = [
    "Як справи?", "Як Ви себе почуваєте?", "Коли будете вдома?",
    "Яку оцінку отримав на ЗНО по українській мові?", "Сьогодні сонячно?",
    "Коли нарешті карантин?", "Як звати Вашого друга?",
    "Ви думаєте вступати у магістратуру?", "Якого кольору Ваш зошит?",
    "Який Ваш настрій сьогодні?"
]
answers = [input(q + " ") for q in questions]


print("\n--- Ваша інформація ---")
print(f"Ваше ім'я: {full_name}")
print(f"Ваш вік: {age}")
print(f"Ви живете в: {city}")
print(f"Ви навчаєтесь в: {university}")
print(f"Номер моєї групи - {group_number}")
print(f"Мій порядковий номер у списку групи - {list_number}")

# 4. Виведення відповідей на додаткові питання
print("\n--- Ваші відповіді на додаткові питання ---")
for i, q in enumerate(questions):
    print(f"{i}. {q} Відповідь: {answers[i]}")
